<template>
  <view>
    <NavBar
      title="用户协议"
      titleSize="34"
      titleColor="#000000"
      :showBack="true"
      totalBackground="#fff"
    ></NavBar>
    <view class="userAgreement">
      <view class="at-header">万包回收用户服务协议</view>
      <view class="at-section-item">
        欢迎您注册由北京万利兴源科技有限公司(以下简称“本公司”)开发与运营的万利兴源平台https://www.wellyspring.com/
        (以下简称“万利兴源”或“本平台”)。本协议是您与本公司之间就您使用本公司服务所订立的协议。请您在点击“注册”按钮前仔细阅读本注册协议,一旦您点击“注册”按钮,您即成为本公司的用户,本协议即构成对本公司和您之间有约束力的法律文件。
      </view>
      <view class="at-header-title"> 一、总则 </view>
      <view class="at-section-item">
        1、为维护网上公共秩序和社会稳定,在使用本公司提供的任何服务时,请您自觉遵守中华人民
        共和国相关法律、法规、部门规章及其他立法机关、行政机关根据法律授权制定的具有强制约束力的法律文件(以下简称“法律法规”),包括但不限于《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《即时通信工具公众信息服务发展管理暂行规定》等现行法律法规、有关部门不时出台的新法律法规以及对现行法律法规作出的调整、更新、修订。若用户违反任何法律法规的要求,本公司有权暂停、中
        断或终止用户使用本公司的部份或全部服务,并配合有关机关可能做出的任何调查、侦查或审查。
        在此情况下,本公司不承担任何责任,并且用户同意承担因此所产生的直接或间接的任何支出或
        损失。在现行法律法规框架下,用户应至少做到:
      </view>
      <view class="at-section-item">
        a)
        不利用本平台危害国家安全、泄露国家秘密,不侵犯国家社会集体的和公民的合法权益,
        不利用本公司服务制作、复制和传播下列信息:
      </view>
      <view class="at-section-item">
        - 煽动抗拒、破坏宪法和法律、行政法规实施的;
      </view>
      <view class="at-section-item">
        - 煽动颠覆国家政权,推翻社会主义制度的;
      </view>
      <view class="at-section-item"> - 煽动分裂国家、破坏国家统一的; </view>
      <view class="at-section-item">
        - 煽动民族仇恨、民族歧视,破坏民族团结的;
      </view>
      <view class="at-section-item">
        - 捏造或者歪曲事实,散布谣言,扰乱社会秩序的;
      </view>
      <view class="at-section-item">
        - 宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的;
      </view>
      <view class="at-section-item">
        - 公然侮辱他人或者捏造事实诽谤他人的,或者进行其他恶意攻击的;
      </view>
      <view class="at-section-item"> - 损害国家机关信誉的; </view>
      <view class="at-section-item"> - 其他违反宪法和法律行政法规的。 </view>
      <view class="at-section-item">
        b) 互相尊重,对自己的言论和行为负责。
      </view>
      <view class="at-section-item">
        2、根据国家法律法规变化及网络运营需要,本公司有权对本协议条款不时地进行修改,如本协议有任何变更或修订,本公司将提前通过万利兴源平台以公告形式通知注册用户。用户可随时登陆查阅最新协议;用户应不时关注并阅读最新版的协议及平台公告。本公司的制定/修订
        的相关服务规则是本协议不可分割的一部分。如用户不同意修改或更新后的协议,应在变更/修
        订后的协议生效前停止接受或使用本公司服务;如用户在变更/修订后的协议生效后继续使用本
        平台提供的服务,即视为同意变更/修订后的协议。若您违反本协议,本公司有权暂停、中断或
        终止用户使用本公司的部份或全部服务。故本公司建议您在每一次使用本公司服务之前均阅读本
        协议及本平台的公告。
      </view>
      <view class="at-header-title"> 二、用户、用户资格 </view>
      <view class="at-section-title"> 1、用户注册 </view>
      <view class="at-section-item">
        1)用户应当同意本协议的条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序
        过程中点击“同意”按钮即表示用户确认其具有签订本协议的资格,并与本站达成协议,完全接受本协议项下的全部条款。
      </view>
      <view class="at-section-item">
        2)用户注册成功后,将在本平台拥有自己的账户及密码,用户有权使用自己的账户及密码随时登录本平台。用户不得以任何形式擅自转让或授权他人使用自己在本平台的账户,如果用户未保管好自己的账户和密码而对用户本人、本公司或第三方造成的损害,将由用户承担全部责任。用户应对其账户所进行的一切行为承担全部责任。用户若发现其账户存在被非法使用或安全漏洞的
        情况,应立即通过电话或者邮件通知本公司。
      </view>
      <view class="at-section-item">
        3)用户应依本公司的提示要求提供本人真实、有效、及完整的个人身份信息,包括但不限于真
        实姓名、联系电话、地址、电子信箱等。用户在此明确授权,本公司有权通过其他第
        三方机构对用户所提供的个人身份信息进行查验。
      </view>
      <view class="at-section-item">
        4)当用户向本公司提供的信息和资料发生变更,用户有义务及时更新个人会员的资料,确保始
        终真实、有效、及时及完整。若用户提供任何错误、虚假、过时或不完整的信息或资料,或者本
        公司有理由怀疑用户的信息或资料为错误、虚假、过时或不完整的,本公司有权暂停、中断或终
        止用户使用本公司的部份或全部服务。在此情况下,本公司不承担任何责任,并且用户同意承担
        因此所产生的直接或间接的任何支出或损失。
      </view>
      <view class="at-section-item">
        5)如因用户向本公司提供的信息或资料不符合前述约定导致的一切法律后果和赔偿责任均由用
        户本人承担,本公司对此不承担任何责任。如因此给本公司造成损失的,用户应当承担相应的赔
        偿责任。
      </view>
      <view class="at-section-title"> 2、用户的权利和义务 </view>
      <view class="at-section-item">
        1)用户在成功注册本平台后,有权根据本协议及相关规则的规定使用本公司提供的各项服务,
        包括但不限于本公司提供的居间服务,用户同意并确认本公司有权随时新增、调整或终止其提供的居间服务类型、种类及数量。
      </view>
      <view class="at-section-item">
        2)用户根据本协议以及本平台相关规则签署电子服务协议后,不得擅自修改该协议。本公司向
        用户提供电子合同的备案、查看、核对服务,如对电子合同真伪或电子合同的内容有任何疑问,
        应以本公司留存的合同为准。
      </view>
      <view class="at-section-item">
        3)用户承诺不对本平台任何资料作商业性利用,并承诺不利用本公司各项服务进行转销售或类
        似的其它商业用途,亦不得滥用本公司服务或以任何方式干扰本公司正常运营。一旦本公司发现
        用户违反本条款的约定,本公司有权暂停、中断或终止用户使用本平台的部份或全部服务。在此
        情况下,本公司不承担任何责任,并且用户同意承担因此所产生的直接或间接的任何支出或损失。
      </view>
      <view class="at-section-item">
        4)本公司将对用户在本平台上的所有操作进行记录,用户可以通过账户实时查询其账户名下的
        所有交易及服务记录。
      </view>
      <view class="at-section-item">
        5)用户明确并同意,在用户使用本公司服务过程中,本公司不承担由于用户自身过错、技术或其它第三方原因而给用户造成的损失。
      </view>
      <view class="at-section-item">
        6)用户同意接收本公司通过各种渠道(包括但不限于短信、网站信息、电话等)向其发送的信
        息。用户亦有权通过下列渠道就在使用本公司服务过程中出现任何问题与本公司进行联系:
      </view>
      <view class="at-section-item"> 客服热线:010-64114360 </view>
      <view class="at-section-item">
        7）用户承诺，如使用本公司信用支付业务，将按照约定时间进行偿还，如发生不能按期偿还，同意按照年化10%支付违约金。
      </view>
      <view class="at-header-title"> 三、本公司的权利义务 </view>
      <view class="at-section-item">
        1、本公司承诺确保万利兴源平台的正常运行,并努力提升和改进技术,保证用户使用本公司服务的顺利进行。本公司有权基于自身的判断随时对相关的技术进行升级、维护、调试,但本公司承诺在进行相关的操作前以公告方式通知所有用户。
      </view>
      <view class="at-section-item">
        2、用户通过本协议约定的渠道向本公司提出的、反映在使用本公司服务中所遇到有关问题及相
        关反映的情况,本公司承诺及时作出回复。
      </view>
      <view class="at-section-item">
        3、本公司有权对用户的注册资料及操作行为进行查阅,有权通过其他第三方核实用户向本公司提交的各项信息。若本公司发现或有合理理由怀疑用户提交的信息中存在任何错误、虚假、过时
        或不完整之处的,本平台有权暂停、中断或终止用户使用本平台的部份或全部服务。
      </view>
      <view class="at-section-item">
        4、用户在使用本公司的信用支付业务时，如发生逾期未还款的情况，逾期一个月以内，本公司将通知用户进行还款，且要求用户按照年化10%支付违约金，如逾期一个月以上，本公司有权提起诉讼，并要求用户赔偿违约金及承担全部诉讼费用。
      </view>
      <view class="at-header-title"> 四、隐私 </view>
      <view class="at-section-item">
        1、用户在本平台注册时或使用本公司服务过程中向本公司提供的一切身份信息,包括个人识别资料:如姓名、身份信息、电话、通信地址、住址、电子邮件地址等情况;
        除本条第 2 款约定的情况外,本公司不会将用户的资料向任何第三方泄露。
      </view>
      <view class="at-section-item">
        2、 双方明确并同意,在下列情况下,任何一方可向第三方披露保密信息:
      </view>
      <view class="at-section-item">
        1)当国家机构依照法定程序要求本公司披露个人资料时;
      </view>
      <view class="at-section-item">
        2)事先获得用户的明确授权;或已取得用户的书面同意;
      </view>
      <view class="at-section-item">
        3)遵守有关法律规定及按照国家有关机关要求,向有关国家机关或行政部门提供用户的注册信息;
      </view>
      <view class="at-section-item">
        4)为完成用户提出的咨询要求,而将相关信息透露给本平台签约专家;
      </view>
      <view class="at-section-item">
        5)公众已能够通过其他合法途径知晓该等信息;
      </view>
      <view class="at-section-item">
        6)为完成用户提出的咨询要求,向本公司员工或与本公司存在合同关系的第三方披露保密信息。
        本公司保证工作人员、委托的第三方,无论劳动关系、委托关系是否存续,均承担与本公司相同
        的保密义务。
      </view>
      <view class="at-header-title"> 六、免责声明 </view>
      <view class="at-section-item">
        1、如因不可抗力或其他本公司无法预见、无法避免、无法克服的原因使本平台系统崩溃或无法
        正常使用导致网上交易无法完成或丢失有关的信息、记录等,本公司不承担责任。但是本公司将
        尽可能合理地协助处理善后事宜,并努力使客户免受经济损失。
      </view>
      <view class="at-section-item">
        2、
        本公司可能因合作关系等原因为其他网站或网页提供链接,用户在点击该链接后将直接进入被链接网站或网页。对于被链接网站或网页与用户之间发生的交易本公司不负保证责任,用户因该交易所产生的纠纷应直接向被链接网站或网页要求解决,并向其主张权利,本公司对该交易不承担任何责任。本公司对任何直接、间接、偶然、特殊及继起的损害不负责任,这些损害可能来自:不正当使用网络服务,在网上购买商品或进行同类型服务,在网上进行交易,非法使用网络
        服务或用户传送的信息有所变动。这些行为都有可能会导致本站的形象受损,所以本站事先提出
        这种损害的可能性。
      </view>
      <view class="at-section-item">
        3、本公司承担赔偿责任的上限,不论是因为合同、保证、侵权(包括过失)项下的还是其它的
        责任所引起的,均不超过您累计向本公司支付的服务费总额。
      </view>
      <view class="at-section-item">
        4、用户在使用本公司服务前,需仔细阅读相关服务的各项规则以及相应的免责说明。如您不同意相关免责说明,请不要注册为本公司用户。
      </view>
      <view class="at-header-title"> 七、争议的解决与法律适用 </view>
      <view class="at-section-item">
        1、本协议的签署、履行和解释及争议的解决均应适用中国法律,并依其解释。
      </view>
      <view class="at-section-item">
        2、就本协议或在本协议履行过程中发生的任何争议,双方应尽力友好协商解决;协商不成时,
        任何一方均可向本公司住所地有管辖权的人民法院提起诉讼。
      </view>
      <view class="at-header-title"> 八、其他 </view>
      <view class="at-section-item">
        1、本公司不行使、未能及时行使或者未充分行使本条款或者按照法律规定所享有的权利,不应被视为放弃该权利,也不影响本公司在将来行使该权利。
      </view>
      <view class="at-section-item">
        2、如本条款中的任何条款无论因何种原因完全或部分无效或不具有执行力,本服务条款的其余条款仍应有效且具有约束力,本公司及用户均应尽力使该条款设定的本意得到实现。
      </view>
      <view class="at-section-item">
        3、您勾选用户注册界面中的“同意平台的用户协议以及隐私协议”方框并提交注册即视为您完全接受本协议,在点击之前请您再次确认已知悉并完全理解本协议的全部内容。
      </view>
      <view class="at-section-item">
        本协议最终解释权归北京万利兴源科技有限公司所有。
      </view>
      <view class="at-section-item">
        北京万利兴源科技有限公司 2021 年 10 月 12 日
      </view>
    </view>
  </view>
</template>

<script>
import NavBar from "@/components/nav-bar";
export default {
  components: { NavBar },
  name: "userAgreement",
};
</script>

<style scoped>
.userAgreement {
  width: 100%;
  height: 100%;
  box-sizing: border-box;
  padding: 30rpx;
  font-size: 25rpx;
}
.at-header {
  width: 100%;
  text-align: center;
  margin-bottom: 30rpx;
  color: #000000;
  font-size: 30rpx;
}
.at-section {
  margin-top: 30rpx;
}
.at-header-title {
  font-size: 28rpx;
  font-weight: 800;
  margin: 25rpx 0;
}
.at-section-item {
  margin: 20rpx 0;
  line-height: 40rpx;
}
</style>